---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ExchangeEntityId
source: html/746d2bde-776d-d86b-ae5f-673453ac838f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ExchangeEntityId Property

"Exchange Entity ID"

## Syntax (C#)
```csharp
public static ForgeTypeId ExchangeEntityId { get; }
```